## LAMBDA FUNCTIONS ##

### A lambda function is a small anonymous function.

<i>"A lambda function can take any number of arguments, but can only have one expression."</i> - W3 Schools

### How Does It Work?

It works the way another function does, except it can also act as an expression

### But why would you use lambda instead of creating a normal function?? ###

<p1>Well, it is faster, and can be used as a 'throwaway function' meaning if you have little or one-time use for it, you don't need to spend as much time defining it</p1>

### For Example

### Adding 5 to any number without using lambda

In [7]:

def add_5(x):
    return x + 5

add_5(5)

10

### Adding 5 to any number using lambda ###

In [9]:
# Adding 5 using lambda 
my_lambda_adder = lambda x: x + 5

# This takes argument x, adds 5 to the number and returns the value
my_lambda_adder(5)

# Alternatively, instead of assigning the lambda function to a variable, this can all be done in a single line
(lambda x: x + 5)(10)

15

Lambda can be used with any number of arguments, like normal functions

In [44]:
# Adding 3 numbers together
(lambda x, y, z: x + y + z)(1, 2, 3)

6

In [46]:
# Random Formula
(lambda x, y, z: 5*(x + y) / z)(1, 2 , 3)

5.0

## Exercise 1

### 1 - Creating a lambda function which multiplies a number by 5 then adds 20 to it

In [ ]:
# Put your answer here plz, many thanks

### But do lambda functions only work with numbers?

NO!

Below I will give an example of how they work in other ways

In [11]:
# With Text
(lambda x: x + " Plus Lambda")("Simple String")

'Simple String Plus Lambda'

## More Relevant Content, How to Use Lambda in Pandas ##

In [38]:
# In Pandas
import pandas as pd
import numpy as np

In [63]:
# Creating a random dataframe
df = pd.DataFrame(data={'Places': ['London', 'Rome', 'Venice', 'Paris', 'Barcelona'],'Average Rating': np.random.random_integers(1, 10, 5),
                        'Population': np.random.random_integers(4000000, 20000000, 5),
                        'Votes': np.random.random_integers(2000000, 4000000, 5) })
df_copy = df.copy()

In [64]:
# Using Lambda to convert all the places to "City of {Place}"
df_copy['Places'] = df_copy['Places'].apply(lambda x: "City of " + x)

### Using Lambda to convert the index of the dataframe

In [65]:
df_copy.index = map(lambda x: 'City ' + str(x + 1), df_copy.index)

1. This gets the index of our dataframe --> df_copy.index
2. Adds 1 to the number --> x + 1
3. Converts the result to a string --> str(x + 1)
4. Adds the string 'City' before it then outputs the result -->  'City ' + str(x + 1)
5. All the results are put into a list which is then used as the new index

In [66]:
df_copy

                   Places  Average Rating  Population    Votes
City 1     City of London               5    18608865  3326590
City 2       City of Rome               3    18852517  3093478
City 3     City of Venice               3    18800115  2869122
City 4      City of Paris               3     4787050  3195503
City 5  City of Barcelona               5    10274895  3976333

 ### What is map?

map(func, iterable) uses a function and applies it to an iterable, this can be a list, a string, a dictionary etc.

### Using Lambda to change values based on a criteria

In [68]:
# Let's take a look at our dataframe again
df

      Places  Average Rating  Population    Votes
0     London               5    18608865  3326590
1       Rome               3    18852517  3093478
2     Venice               3    18800115  2869122
3      Paris               3     4787050  3195503
4  Barcelona               5    10274895  3976333

### If....else statements in lambda functions

General Syntax: 

 lambda (arguments) : Return Value if condition is True.. if...condition...else...Return Value if condition is False

In [86]:
# Example: Returns the value only if it is a string
(lambda x: x if type(x) == str else None)('Lambda')

'Lambda'

In [88]:
# Example using df: Sets the value in the column to True or False based on a criteria
df['Good Rating'] = df['Average Rating'].map(lambda x: True if x >= 5 else False)

      Places  Average Rating  Population    Votes    Valid  Good Rating
0     London               5    18608865  3326590  3326590         True
1       Rome               3    18852517  3093478  3093478        False
2     Venice               3    18800115  2869122        0        False
3      Paris               3     4787050  3195503  3195503        False
4  Barcelona               5    10274895  3976333  3976333         True

## What this does

1. Creates a new column called 'Good Rating' --> df['Good Rating']
2. Uses the column 'Average Rating' and apply a map to it --> df['Average Rating'].map(...)
3. Filters through each element in the Series and if it Greater than 5, returns True, if not returns False --> lambda x: True if x >= 5 else False
4. This output a list, which is set to the new column

## Modified DataFrame

In [89]:
df

      Places  Average Rating  Population    Votes    Valid  Good Rating
0     London               5    18608865  3326590  3326590         True
1       Rome               3    18852517  3093478  3093478        False
2     Venice               3    18800115  2869122        0        False
3      Paris               3     4787050  3195503  3195503        False
4  Barcelona               5    10274895  3976333  3976333         True